Load_testing/100_user.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">1000</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler" testname="WebSocket request-response Sampler">
          <boolProp name="createNewConnection">true</boolProp>
          <boolProp name="TLS">false</boolProp>
          <stringProp name="server">socket.tidio.co</stringProp>
          <stringProp name="port">80</stringProp>
          <stringProp name="path">/socket.io/?ppk=f68alvbow3erq1xsz4cbf4fnv91ppbh&amp;device=desktop&amp;cmv=2_0&amp;EIO=4&amp;transport=websocket</stringProp>
          <stringProp name="connectTimeout">20000</stringProp>
          <stringProp name="payloadType">Text</stringProp>
          <stringProp name="requestData">427[&quot;visitorNewMessage&quot;,{&quot;message&quot;:&quot;Hi&quot;,&quot;messageId&quot;:&quot;8142f58f-2baf-4157-b30c-dbf226a77812&quot;,&quot;url&quot;:&quot;http://192.168.137.98:8000/Desktop/Testing%20site.html&quot;,&quot;visitorId&quot;:&quot;6079be20cef64f72a31e49489425b0c8&quot;,&quot;projectPublicKey&quot;:&quot;f68alvbow3erq1kzsz4cbf4frv91ppbh&quot;,&quot;device&quot;:&quot;desktop&quot;}]</stringProp>
          <stringProp name="readTimeout">6000</stringProp>
          <boolProp name="loadDataFromFile">false</boolProp>
        </eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>